
Network Working Group                                W A Simpson, Editor
Internet Draft                                                Daydreamer
expires in six months                                          July 1994


                          IP Mobility Support
                  draft-ietf-mobileip-protocol-05.txt                     |



Status of this Memo

   This document is a submission to the Mobile-IP Working Group of the
   Internet Engineering Task Force (IETF).  Comments should be submitted
   to the mobile-ip@ossi.com mailing list.

   Distribution of this memo is unlimited.

   Internet Drafts are working documents of the Internet Engineering
   Task Force (IETF), its Areas, and its Working Groups.  Note that
   other groups may also distribute working documents as Internet
   Drafts.

   Internet Drafts are draft documents valid for a maximum of six
   months.  Internet Drafts may be updated, replaced, or obsoleted by
   other documents at any time.  It is not appropriate to use Internet
   Drafts as reference material or to cite them other than as a
   ``working draft'' or ``work in progress.''

   Please check the 1id-abstracts.txt listing contained in the
   internet-drafts Shadow Directories on nic.ddn.mil, ds.internic.net,
   venera.isi.edu, nic.nordu.net, or munnari.oz.au to learn the current
   status of any Internet Draft.


Abstract

   This document specifies protocol enhancements that allow transparent
   routing of IP datagrams to Mobile Nodes in the Internet.  The Mobile
   Node is always identified by its Home-Address, regardless of its
   current point of attachment to the Internet.  While situated away
   from its home, a Mobile Node is also associated with a Care-Of-
   Address, which provides information about its current point of
   attachment to the Internet.  The protocol provides for registering
   the Care-Of-Address with a Home Agent.  The Home Agent sends traffic
   destined for the Mobile Node through a tunnel to the Care-Of-Address.





Simpson                  expires in six months                  [Page i]
DRAFT                         IP Mobility                      July 1994


1.  Introduction

   Current versions of the Internet Protocol make an implicit assumption
   that a node's point of attachment remains fixed.  Datagrams are sent
   to a node based on the location information contained in the node's
   IP address.

   If a node moves while keeping its IP address unchanged, its network
   number will not reflect its new point of attachment.  The routing
   protocols will not be able to route datagrams to it correctly.

   This document defines new functions that allow a node to roam on the
   Internet, without changing its IP address.

   The following entities are defined:

   Mobile Node

      A host or router that changes its point of attachment from one      |
      network or subnetwork to another.

   Home Agent

      A router that advertises reachability for a Mobile Node, maintains
      a registry of the current Mobility Bindings for that Mobile Node,
      and encapsulates datagrams for delivery to the Mobile Node while
      it is away from home.

   Foreign Agent

      A router that assists a locally reachable Mobile Node that is away
      from its home network.

   The following support services are defined:

   Agent Discovery

      All Agents advertise their availability on each link for which
      they provide service.

      A newly arrived Mobile Node can send a solicitation on the link to
      learn if any prospective Agents are present.

   Care-Of-Address Assignment

      The Care-Of-Address terminates the end of a tunnel toward a Mobile
      Node.  Depending on the foreign network configuration, the Care-
      Of-Address may be either dynamically assigned to the Mobile Node



Simpson                  expires in six months                  [Page 1]
DRAFT                         IP Mobility                      July 1994


      or associated with a Foreign Agent.

   Registration

      When the Mobile Node is away from home, it registers the Care-Of-
      Address with a Home Agent.

      Depending on its method of attachment, the Mobile Node will
      register either directly with a Home Agent, or through a Foreign
      Agent which forwards the registration to the Home Agent.

   Encapsulation

      Once a Mobile Node has registered a Care-Of-Address with a Home
      Agent, the Home Agent intercepts datagrams destined for the Mobile
      Node, formulates another datagram with the intercepted datagram
      enclosed within, and forwards the resulting datagram to the Care-
      Of-Address.

   Decapsulation

      At the Care-Of-Address, the enclosed datagram is extracted.

      When the Mobile Node has its own Care-Of-Address, it decapsulates
      its own datagrams.

      When the Care-Of-Address is associated with a Foreign Agent, the
      Foreign Agent decapsulates the datagrams.  If the datagram is
      addressed to a Mobile Node which the Foreign Agent is currently
      serving, it will deliver the datagram to the Mobile Node.           *



1.1.  Requirements

   A Mobile Node using its Home-Address shall be able to communicate
   with other nodes after having been disconnected from the Internet,
   and then reconnected at a different point of attachment.

   A Mobile Node shall continue to be capable of communicating directly
   with existing nodes which do not implement the mobility functions      |
   described in this document.

   A Mobile Node shall provide authentication in its registration
   messages.






Simpson                  expires in six months                  [Page 2]
DRAFT                         IP Mobility                      July 1994


1.2.  Goals

   The Mobile Node's directly attached link is likely to be bandwidth
   limited.  Few administrative messages are sent between a Mobile Node
   and an Agent.  The size of these messages are kept as short as
   possible.



1.3.  Assumptions

   The protocols defined in this document place no additional
   requirements on assignment of IP addresses.  That is, a Mobile Node
   will be assigned an IP address by the organization that owns the
   machine, and will be able to use that IP address regardless of the
   current point of attachment.

   Mobile Nodes are able to change their point of attachment to the
   Internet no more frequently than once per second.

   No protocol enhancements are required in hosts or routers that are
   not serving any of the mobility functions.  Similarly, no additional
   protocols are needed by a router (that is not acting as a Home Agent
   or a Foreign Agent) to route datagrams to or from a Mobile Node.

   The operation of this specification assumes that IP datagrams are      |
   routed to a Destination without regard to the Source of the datagram.

   If desired, the Mobile Node can create tunnel(s) to its Home Agent.
   The definition of such mechanisms is outside the scope of this         |
   document.



1.4.  Specification Language

   In this document, several words are used to signify the requirements
   of the specification.  These words are often capitalized.

   MUST      This word, or the adjective "required", means that the
             definition is an absolute requirement of the specification.

   MUST NOT  This phrase means that the definition is an absolute
             prohibition of the specification.

   SHOULD    This word, or the adjective "recommended", means that there
             may exist valid reasons in particular circumstances to
             ignore this item, but the full implications must be



Simpson                  expires in six months                  [Page 3]
DRAFT                         IP Mobility                      July 1994


             understood and carefully weighed before choosing a
             different course.

   MAY       This word, or the adjective "optional", means that this
             item is one of an allowed set of alternatives.  An
             implementation which does not include this option MUST be
             prepared to interoperate with another implementation which
             does include the option.

   silently discard
             The implementation discards the packet without further
             processing, and without indicating an error to the sender.
             The implementation SHOULD provide the capability of logging
             the error, including the contents of the discarded packet,
             and SHOULD record the event in a statistics counter.



1.5.  Terminology

   This document frequently uses the following terms:

   Authentication Type
             This includes the algorithm and algorithm mode.  Note that
             a single algorithm (such as DES) might have several modes
             (for example, CBC and ECB).

   Correspondent
             A peer with which a Mobile Node is communicating.  The
             Correspondent may be either mobile or stationary.

   Home-Address
             A long-term IP address that is assigned to a Mobile Node.
             It remains unchanged regardless of where the node is
             attached to the Internet.  Datagrams addressed to the
             Home-Address are intercepted by the Home Agent while the
             Mobile Node is registered with that Home Agent.

   Link      A communication facility or medium over which nodes can
             communicate at the link layer; underlying the network
             layer.

   Mobility Binding
             The association of a Home-Address with a Care-Of-Address,
             and the remaining LifeTime of the association.

   Routing Prefix
             The high-order bits in an address, which are used by



Simpson                  expires in six months                  [Page 4]
DRAFT                         IP Mobility                      July 1994


             routers to locate a link for delivery of a datagram.

   Mobility Security Association
             The security relationship between two nodes that is used
             with Mobile IP protocol messages.  This relationship
             includes the authentication type (including algorithm and
             algorithm mode), the secret (such as a shared key, or
             appropriate public/private key pair), and possibly other
             information such as labelling.

   Triangle Routing
             A path followed by a datagram destined for a Mobile Node,
             when that datagram arrives first at the Home Agent, and
             then is encapsulated and forwarded by the Home Agent.





































Simpson                  expires in six months                  [Page 5]
DRAFT                         IP Mobility                      July 1994


2.  Agent Discovery

   To communicate with a Foreign or Home Agent, a Mobile Node must learn
   either the IP address or the link address of that Agent.

   It is assumed that a link-layer connection has been established
   between the Agent and the Mobile Node.  The method used to establish
   such a link-layer connection is not specified in this document.

   After establishing a link-layer connection that supports the
   attachment of Mobile Nodes, the node learns whether there are any
   Agents available.  If the Home Agent is recognized, the Mobile Node
   is at home.

   There are often several methods of learning the availability of an
   Agent.  Those described here are recommended.

   Point-to-Point Link-Layers

      The Point-to-Point-Protocol (PPP) [RFC-1548] Internet Protocol
      Control Protocol (IPCP) [RFC-1332], negotiates the use of IP
      addresses.

      When the Home-Address is not accepted, but a transient IP address
      is dynamically assigned, that address is used as the Care-Of-
      Address in registration.

      When no transient IP address is dynamically assigned, but an IP
      address is advertised by the peer, that address is assumed to be
      the IP address of an Agent.

   Multi-Point Link-Layers

      Another link establishment protocol, IEEE 802.11, might yield the
      link address of an agent.  This link-layer address is used to
      attempt registration.

   ICMP Router Discovery

      An Agent which is not identified by a link-layer protocol MUST
      implement ICMP Router Discovery [RFC-1256].  The Router
      Advertisements indicate whether the router is also an Agent.

   It is recommended that as few messages as possible which duplicate
   functionality be sent on mobile links.  This is particularly
   important on wireless and congested links.

   When multiple methods are in use, the Mobile Node SHOULD first



Simpson                  expires in six months                  [Page 6]
DRAFT                         IP Mobility                      July 1994


   attempt registration with routers sending Router Advertisements in
   preference to those sending link-layer advertisements.  This ordering
   maximizes the likelihood that the registration will be recognized,
   thereby minimizing the number of registration attempts.

   An Administrative Domain MAY require registration with a Foreign
   Agent even when another registration method is in use.  This facility
   is envisioned for service providers with packet filtering fire-walls,
   or visiting policies (such as accounting) which require exchanges of
   authorization.



2.1.  Authentication

   No authentication is required for the advertisement and solicitation
   process.

   These messages MAY be authenticated using a future IP Authentication
   Header, which is external to the messages described here.  Further
   work on authentication of advertisement and solicitation is outside
   of the scope of this document.

   Whenever an externally authenticated message fails authentication,
   the message is silently discarded.



2.2.  Agent Solicitation

   Every Mobile Node is required to implement ICMP Router Solicitation.
   However, the Router Solicitation is only sent when no Care-Of-Address
   has been determined through a link-layer protocol or Router
   Advertisement.

   Any Foreign Agent and Home Agent which is not identified by a link-
   layer protocol MUST respond to ICMP Router Solicitation.               |

   The same procedures, defaults, and constants are used as described in
   "ICMP Router Discovery Messages" [RFC-1256].



2.3.  Agent Advertisement

   Every Mobile Node is required to correctly process ICMP Router
   Advertisements.




Simpson                  expires in six months                  [Page 7]
DRAFT                         IP Mobility                      July 1994


   Any Foreign Agent and Home Agent which is not identified by a link-
   layer protocol MUST send ICMP Router Advertisements.

   An Agent which is identified by a link-layer protocol SHOULD also
   implement Router Advertisements.  However, the Router Advertisements
   need not be sent, except when the site policy requires registration
   with the Agent, or as a response to a specific Router Solicitation.

   The same procedures, defaults, and constants are used as described in
   "ICMP Router Discovery Messages" [RFC-1256], except as specified
   herein.

   The Router Advertisements are extended by examining the number of
   advertised addresses.  When the IP total length indicates that the
   ICMP message is longer than needed for the number of addresses
   present, the remainder is interpreted as extensions.  The extensions
   are described in the "Mobility Message Extensions" chapter.

   The Mobility Extension is required, and indicates that the router is
   an Agent.  Other extensions indicate optionally supported features.    |

   The Code field of the ICMP Router Advertisement is interpreted as
   follows:

   0     If the Mobility Extension is present, the router supports
         mobility registration.  The router is participating in routing
         common traffic.

   16    A Home or Foreign Agent which supports registration, but is not
         participating in routing common traffic.

   A Foreign Agent includes the Care-Of-Address as a Router Address.

   The Mobile Node examines the Agent Advertisement.  If any Router
   Address listed exactly matches a Home Agent in its list, the Mobile
   Node is at home.

   Otherwise, the Care-Of-Address is chosen from among advertising
   Agents in the same fashion as the Mobile Node would choose a first
   hop router.  The highest preference Router Address which falls within
   a subnet that the Mobile Node has configured on its mobile
   interface(s) is used for the Care-Of-Address.                          |

   It is very likely that no Routing-Prefix matches when the Mobile Node  |
   is not at home.  In this case, the highest preference non-matching
   Router Address is used for the Care-Of-Address.





Simpson                  expires in six months                  [Page 8]
DRAFT                         IP Mobility                      July 1994


3.  Registration

   The registration function exchanges information between Mobile Nodes
   and Home Agents.  This function creates a Mobility Binding, linking
   the Home-Address with a Care-Of-Address to be used to reach the
   Mobile Node.

   When assigned a transient Care-Of-Address, a Mobile Node can act
   without a Foreign Agent, and register or de-register directly with a
   Home Agent.  This registration process involves the exchange of only
   2 messages:

   a)    The Mobile Node sends a Registration Request to a Home Agent,
         to ask that Home Agent to provide the requested service.

   b)    The Home Agent sends a Registration Reply to the Mobile Node to
         grant or deny service.

   An Administrative Domain MAY require registration through a Foreign
   Agent, as indicated in Agent Advertisements.

   When the Care-Of-Address is associated with a Foreign Agent, the
   Foreign Agent acts as a relay between the Mobile Node and Home Agent.
   This extended registration process involves the exchange of 4
   messages:

   a)    The Mobile Node sends a Registration Request to the prospective
         Foreign Agent to begin the registration process.

   b)    The Foreign Agent relays the request by sending a Registration
         Request to the Home Agent, to ask that Home Agent to provide
         the requested service.

   c)    The Home Agent sends a Registration Reply to the Foreign Agent
         to grant or deny service.

   d)    The Foreign Agent sends a copy of the Registration Reply to the
         Mobile Node to inform it of the disposition of its request.



3.1.  Authentication

   Each Mobile Node, Foreign Agent, and Home Agent MUST support an
   internal table holding a list of IP addresses, and the Mobility
   Security Association for each address.

   Mobile Node to Home Agent registration messages are required to be



Simpson                  expires in six months                  [Page 9]
DRAFT                         IP Mobility                      July 1994


   authenticated with the Mobile-Home Authentication Extension.  The
   Mobile Node and Home Agent MUST support authentication using keyed
   MD5 and key sizes of 128 bits or greater, with manual key
   distribution.  Additional authentication algorithms, algorithm modes,
   and key distribution methods MAY also be supported.

   In addition, the Foreign Agent SHOULD support authentication using
   keyed MD5 and key sizes of 128 bits or greater, with manual key
   distribution.  Additional authentication algorithms, algorithm modes,
   and key distribution methods MAY also be supported.

   Only one Mobility Security Association exists between any given pair
   of participating nodes at any given time.

   Whenever a Mobility Security Association exists between a pair of
   nodes, all registration messages between these nodes MUST be
   authenticated, using the appropriate authentication extension.



3.2.  UDP

   The Registration messages defined herein use the User Datagram
   Protocol header [RFC-768].

   The UDP checksum is required.  Any mobility message with an incorrect
   or zero UDP checksum is silently discarded.
























Simpson                  expires in six months                 [Page 10]
DRAFT                         IP Mobility                      July 1994


3.3.  Registration Request

   The UDP Header is followed by the fields shown below:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |           LifeTime            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                           Home Agent                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Home-Address                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Care-Of-Address                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Reserved                    |  Prefix-Size  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                           TimeStamp                           +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Extensions ...
   +-+-+-+-+-+-+-+-

   IP fields:

      Source           An IP address belonging to the interface on which
                       this message is sent.                              |

                       A Mobile Node MUST use the transient Care-Of-      |
                       Address when assigned; otherwise, the Home-        |
                       Address is used.

      Destination      The IP address of the Agent, when known.

                       When the IP address is unknown (the agent was
                       discovered via a link-layer protocol), the "all
                       Mobile Agents" multicast address.  The link-layer
                       unicast address is used to deliver the datagram
                       to the correct Agent.

   UDP fields:

      Source Port      variable

      Destination Port <TBD>

   MobileIP fields:



Simpson                  expires in six months                 [Page 11]
DRAFT                         IP Mobility                      July 1994


      Type

                       1 when sent by the Mobile Node
                       2 when sent by the Foreign Agent


      Code             Optional capabilities:

                         0 - remove prior registrations
                         1 - retain prior registrations


      LifeTime         The seconds remaining before the registration is
                       considered expired.  A value of zero indicates a
                       request for de-registration.  A value of all ones
                       indicates infinity.

      Home Agent       The IP address of a Home Agent.

      Home-Address     The IP address of the Mobile Node.                 |

      Care-Of-Address  The IP address for the decapsulation end of a
                       tunnel.

      Reserved         Sent as zero; ignored on reception.

      Prefix-Size      The size of the left-justified bit-mask that is
                       applied to the Home-Address to determine the IP
                       Routing-Prefix.  Ranges from 0 to 30.  Set to
                       zero by Mobile Nodes which are not routers.

      TimeStamp        64 bits.  A sequence number assigned by the
                       Mobile Node.  A Network Time Protocol [RFC-1305]
                       value is preferred, but the elapsed time since
                       system startup, or any other monotonically
                       increasing counter MAY be used.  The value MUST
                       NOT be the same as an immediately preceeding
                       request.

      The Mobile-Home Authentication Extension is required, and
      immediately follows all non-authentication extensions.

      The Mobile-Foreign or Foreign-Home Authentication Extension is
      optional, and immediately follows the Mobile-Home Authentication
      Extension.

   When forwarded by a Foreign Agent, fields and extensions which are
   specific to the Foreign Agent are removed.  All others are copied



Simpson                  expires in six months                 [Page 12]
DRAFT                         IP Mobility                      July 1994


   without modification.


















































Simpson                  expires in six months                 [Page 13]
DRAFT                         IP Mobility                      July 1994


3.4.  Registration Reply

   The UDP Header is followed by the fields shown below:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |           LifeTime            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Home-Address                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Reserved                    |  Prefix-Size  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                           TimeStamp                           +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Extensions ...
   +-+-+-+-+-+-+-+-

   IP fields:

      The Source and Destination of the Request message are swapped for
      the Reply message.

      Note that the Source of the original Registration Request must be
      saved in order for the Foreign Agent to return the reply to the
      correct Mobile Node.

   UDP fields:

      The Source Port and Destination Port of the Request message are
      swapped for the Reply message.

      Note that the Source Port of the original Registration Request
      must be saved in order for the Foreign Agent to return the reply
      to the correct Mobile Node port.

   MobileIP fields:

      Type             3

      Code             One of the following codes:

                         0  service will be provided.

                       denied by Foreign Agent,
                        16  reason unspecified.



Simpson                  expires in six months                 [Page 14]
DRAFT                         IP Mobility                      July 1994


                        17  administratively prohibited.
                        18  insufficient resources.
                        19  Mobile Node failed authentication.
                        20  Home Agent failed authentication.
                        21  Request LifeTime too long.

                       denied by Home Agent,
                        32  reason unspecified.
                        33  administratively prohibited.
                        34  insufficient resources.
                        35  Mobile Node failed authentication.
                        36  Foreign Agent failed authentication.

                       Up-to-date values of the Code field are specified  |
                       in the most recent "Assigned Numbers" [RFC-1310].

      LifeTime         The seconds remaining before the registration is
                       considered expired.  A value of zero confirms a
                       request for de-registration.  A value of all ones
                       indicates infinity.

      Home-Address     Copied from the Request message.

      Reserved         Copied from the Request message.

      Prefix-Size      Copied from the Request message.

      TimeStamp        Copied from the Request message.

      The Mobile-Home Authentication Extension is required, and
      immediately follows all non-authentication extensions.

      The Mobile-Foreign or Foreign-Home Authentication Extension is
      optional, and immediately follows the Mobile-Home Authentication
      Extension.

      Note that the Care-Of-Address and Home Agent are not present in
      the message.  This provides a separate calculation value for
      mutual authentication.

   When forwarded by a Foreign Agent, fields and extensions which are
   specific to the Foreign Agent are removed.  All others are copied
   without modification.








Simpson                  expires in six months                 [Page 15]
DRAFT                         IP Mobility                      July 1994


4.  Mobility Message Extensions

   To promote extensibility, each message begins with a short fixed
   part, which is followed by one or more extensions in Type-Length-
   Value format.

   Extensions allow variable amounts of information to be carried within
   each datagram.  The end of the list of Extensions is indicated by the
   Total Length of the IP datagram.

   These extensions apply to messages in both preceding chapters.


    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |   Extension   |    Length     |    Data ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Extension        Current values are assigned as follows:

                     16     Mobility
                     32     Mobile-Home Authentication
                     33     Mobile-Foreign Authentication
                     34     Foreign-Home Authentication
                     64     Minimal Encapsulation
                     65     GRE Encapsulation

                    Up-to-date values are specified in the most recent    |
                    "Assigned Numbers" [RFC-1310].

   Length           Indicates the length of the Data field.  The Length
                    does not include the Extension and Length bytes.

   Data             This field is zero or more bytes and contains the
                    value(s) for this Extension.  The format and length
                    of the Data field is determined by the Extension and
                    Length fields.

   When an extension is encountered which is not recognized, it is
   ignored.  The length field is used to skip the data field in
   searching for the next extension.








Simpson                  expires in six months                 [Page 16]
DRAFT                         IP Mobility                      July 1994


4.1.  Mobility Extension


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        Sequence Number        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |F|  Reserved   |
   +-+-+-+-+-+-+-+-+


   Extension        16

   Length           3

   Sequence Number  Contains the number of advertisement messages sent
                    since the node was initialized.  This number MUST
                    count this advertisement; that is, it begins with
                    one (1) and wraps to zero (0).

                    When this value decreases, the Mobile Node MUST
                    assume that any current registration has been lost.
                    This field cannot roll over in less than 2**16
                    seconds, and rollover is unambiguously indicated by
                    the value zero (0).

   F                Foreign Agent bit.  When this bit is set to 1,
                    registration through the Foreign Agent is required,
                    even when the Mobile Node has acquired a transient
                    Care-Of-Address.

   Reserved         Sent as zero; ignored on reception.

   The Mobility Extension is found in Agent Advertisements.



4.2.  Mobile-Home Authentication Extension


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        Authenticator ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Simpson                  expires in six months                 [Page 17]
DRAFT                         IP Mobility                      July 1994


   Extension

                    32


   Length           The number of data bytes in the Extension (16 when
                    MD5 is used).

   Authenticator    Variable length (128 bits for MD5).

                    A hash value taken over a stream of bytes consisting
                    of the shared secret, followed by (concatenated
                    with) the fields in the message beginning with the
                    Code field, including all prior extensions, and the
                    Type and Length of this extension, but not including
                    the Authenticator field itself, and finally the
                    shared secret again.

   This Authentication Extension is found in all Registration Requests
   and Replies.

   The value differs depending on the direction the message is sent,
   since the Registration Request and Reply have different fields.



4.3.  Mobile-Foreign Authentication Extension


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        Authenticator ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension

                    33


   Length           The number of data bytes in the Extension (16 when
                    MD5 is used).

   Authenticator    Variable length (128 bits for MD5).

                    A hash value taken over a stream of bytes consisting
                    of the shared secret, followed by (concatenated



Simpson                  expires in six months                 [Page 18]
DRAFT                         IP Mobility                      July 1994


                    with) the Source, the Destination, the remaining
                    fields in the message beginning with the UDP header,
                    including all prior extensions, and the Type and
                    Length of this extension, but not including the
                    Authenticator field itself, and finally the shared
                    secret again.

   This Authentication Extension is found in Registration Requests and
   Replies where a Mobility Security Association exists between the
   Mobile Node and a Foreign Agent.

   The value differs depending on the direction the message is sent,
   since the Registration Request and Reply have different fields.



4.4.  Foreign-Home Authentication Extension


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |             Nonce             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Authenticator ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension

                    34


   Length           The number of data bytes in the Extension (18 when
                    MD5 is used).

   Nonce            A number to distinguish the authentication.  With
                    respect to a TimeStamp of a given Mobile Node and
                    Home Agent pair, the number SHOULD be unique.  The
                    number MAY be unpredictable (random).

   Authenticator    Variable length (128 bits for MD5).

                    A hash value taken over a stream of bytes consisting
                    of the shared secret, followed by (concatenated
                    with) the Source, the Destination, the remaining
                    fields in the message beginning with the UDP header,
                    including all prior extensions, and the Type and



Simpson                  expires in six months                 [Page 19]
DRAFT                         IP Mobility                      July 1994


                    Length of this extension, but not including the
                    Authenticator field itself, and finally the shared
                    secret again.

   This Authentication Extension is found in Registration Requests and
   Replies where a Mobility Security Association exists between the
   Foreign Agent and the Home Agent.

   The value differs depending on the direction the message is sent,
   since the Registration Request and Reply have different fields.



4.5.  Minimal Encapsulation Extension


    0                   1
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        64

   Length           0

   The Minimal Encapsulation Extension is found in Agent Advertisements
   and Registration Requests.






















Simpson                  expires in six months                 [Page 20]
DRAFT                         IP Mobility                      July 1994


5.  Forwarding Datagrams to the Mobile Node

5.1.  IP in IP Encapsulation

   Support for IP in IP encapsulated datagrams is required.

   An outer, full-sized IP fragmentation header is inserted before the
   datagram's IP header:

                                          +---------------------------+
                                          |      Outer IP Header      |
      +---------------------------+       +---------------------------+
      |         IP Header         |       |         IP Header         |
      +---------------------------+ ====> +---------------------------+
      |                           |       |                           |
      |         IP Payload        |       |         IP Payload        |
      |                           |       |                           |
      +---------------------------+       +---------------------------+

   The format of the IP header is as described in [RFC-791].  The outer
   IP header Source and Destination addresses identify the "endpoints"
   of the tunnel.  The inner IP header Source and Destination addresses
   identify the sender and recipient of the datagram.

   The Protocol field in the outer IP header is set to protocol number
   <TBD> for the encapsulation protocol.

   The Destination field in the outer IP header set to the Care-Of-
   Address of the Mobile Node.

   The Source field in the outer IP header is set to the IP address of
   the encapsulating agent.

   When the datagram is encapsulated, the Time To Live (TTL) field in
   the outer IP header is set to be the same as the original datagram.

   When decapsulating, the outer IP TTL minus one is inserted into the
   inner IP TTL.  Thus, IP hops are counted, but the actual routers
   interior to the tunnel are not identified.












Simpson                  expires in six months                 [Page 21]
DRAFT                         IP Mobility                      July 1994


5.2.  Minimal Encapsulation

   A minimal forwarding header is defined for datagrams which are not
   fragmented prior to encapsulating.  When a datagram is already
   fragmented prior to encapsulating, IP in IP is used.

   Use of this encapsulating method is optional.

   The minimal header is inserted between the datagram's IP header and
   the rest of the datagram:

      +---------------------------+       +---------------------------+
      |         IP Header         |       |     Modified IP Header    |
      +---------------------------+ ====> +---------------------------+
      |                           |       |     Forwarding Header     |
      |         IP Payload        |       +---------------------------+
      |                           |       |                           |
      +---------------------------+       |         IP Payload        |
                                          |                           |
                                          +---------------------------+

   A Foreign Agent which is capable of decapsulating the minimal header
   will include the Minimal Encapsulation Extension in its Router
   Advertisements.

   A Mobile Node indicates the capability of decapsulating the minimal
   header at the Care-Of-Address by the inclusion of the Minimal
   Encapsulation Extension in its Registration Request.

   The Minimal Encapsulation Extension is not included in the
   Registration Reply.  The use of the minimal header is entirely at the
   discretion of the Home Agent.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Protocol    |S|  Reserved   |        Header Checksum        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         Home-Address                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Correspondent Source Address                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Protocol         Copied from the Protocol field in the original IP
                    header.




Simpson                  expires in six months                 [Page 22]
DRAFT                         IP Mobility                      July 1994


   S                Source field present bit, which indicates that the
                    Correspondent Source Address field is present.

                      0  not present.
                      1  present.


   Reserved         Sent as zero; ignored on reception.

   Header Checksum  The 16-bit one's complement of the one's complement
                    sum of the encapsulation header.  For computing the
                    checksum, the Checksum field is set to 0.

   Home-Address     Copied from the Destination field in the original IP
                    header.

   Correspondent Source Address
                    Copied from the Source field in the original IP
                    header.  Present only if the S-bit is set.

   The Protocol field in the IP header is replaced by protocol number
   <TBD> for the encapsulation protocol.

   The Destination field in the IP header is replaced by the Care-Of-
   Address of the Mobile Node.

   If the encapsulating agent is not the original source of the
   datagram, the Source field in the IP header is replaced by the IP
   address of the encapsulating agent.

   Finally, the Don't Fragment bit is set in the IP header.

   When decapsulating a datagram, the fields in the forwarding header
   are restored to the IP header, and the forwarding header is removed
   from the datagram.



5.3.  Tunnel Management

   It is possible that one of the routers along the tunnel interior
   might encounter an error while processing the datagram, causing it to
   return an IP ICMP error message to the source end of the tunnel.  The
   three types of ICMP errors that can occur in this circumstance are:

    - Datagram too big.
    - Time Exceeded.
    - Destination Unreachable.



Simpson                  expires in six months                 [Page 23]
DRAFT                         IP Mobility                      July 1994


   Unfortunately, ICMP only requires IP routers to return 8 bytes (64
   bits) of the datagram beyond the IP header.  This is not enough to
   include the encapsulated header, so it is not generally possible for
   the Home Agent to immediately reflect the ICMP message from the
   interior of a tunnel back to the source host.

   However, by carefully maintaining "soft state" about its tunnels, the
   encapsulating router can return accurate ICMP messages in most cases.
   The router SHOULD maintain at least the following soft state
   information about each tunnel:

    - MTU of the tunnel.
    - TTL (path length) of the tunnel
    - Reachability of the end of the tunnel.

   The router uses the ICMP messages it receives from the interior of a
   tunnel to update the soft state information for that tunnel.  When
   subsequent datagrams arrive that would transit the tunnel, the router
   checks the soft state for the tunnel.  If the datagram would violate
   the state of the tunnel (such as, the TTL is less than the tunnel
   TTL) the router sends an ICMP error message back to the source, but
   also forwards the datagram into the tunnel.

   Using this technique, the ICMP error messages sent by encapsulating
   routers will not always match up one-to-one with errors encountered
   within the tunnel, but they will accurately reflect the state of the
   network.

   The Don't Fragment bit is always set within the tunnel.  This enables
   the proper MTU of the tunnel to be determined.

   Fragmentation which occurs because of the size of the encapsulation
   header is done before encapsulation, preventing more than one layer
   of fragmentation in a single datagram.

















Simpson                  expires in six months                 [Page 24]
DRAFT                         IP Mobility                      July 1994


6.  Mobile Node Considerations

   A Mobile Node listens for Agent Advertisements at all times that it
   has a link connection.  In this manner, it can learn that its Foreign
   Agent has changed, or that it has arrived home.  The determination
   that the point of attachment is at home or away from home is entirely
   at the discretion of the Mobile Node, based on the information
   obtained from Agent Advertisements.

   Whenever a Mobile Node detects a change in its point of attachment,
   it MUST initiate the registration process.  If it is away from home,
   it MUST either register through a Foreign Agent where required, or
   directly with a Home Agent.  If it is returning home, it MUST de-
   register with its Home Agent.

   A Mobile Node will operate without the support of mobility functions
   when it is at home.



6.1.  Configuration and Registration Tables

   Each Mobile Node will need:

    - Home-Address
    - Prefix-Size
    - one or more Home Agents

   For each pending registration:

    - Media Address of Agent
    - Care-Of-Address
    - TimeStamp used
    - LifeTime

   For each Mobility Security Association:

    - Authentication Type
    - Authentication Key



6.2.  Registration When Away From Home

   If a Mobile Node detects a reduction in the Sequence Number of an
   Agent Advertisement from a Foreign Agent through which it has
   registered, the Mobile Node SHOULD re-register.  Such a reduction
   does not include the wrap of the Sequence Number to zero.



Simpson                  expires in six months                 [Page 25]
DRAFT                         IP Mobility                      July 1994


   The LifeTime of the registration SHOULD NOT be set to greater than
   the LifeTime learned in an Agent Advertisement.  When the method by
   which the Care-Of-Address is learned does not include a LifeTime, the
   default Router Advertisement LifeTime (1800 seconds) is used.

   The LifeTime MAY be modified by the Home Agent in its reply.

   A Mobile Node SHOULD re-register before the LifeTime of its
   registration expires.  The Mobile Node MAY re-register at any time.

   A Mobile Node MAY ask a Home Agent to terminate forwarding service to
   a particular Care-Of-Address, by sending a registration with a
   LifeTime of zero.



6.3.  Registration without a Foreign Agent

   In cases where a Mobile Node away from home is able to dynamically
   acquire a transient IP address, the Mobile Node can serve without a
   Foreign Agent, using the transient address as the Care-Of-Address.

   In these cases, all communication between the Mobile Node and its
   Home Agent is direct.  This eliminates the need to deploy separate
   entities as Foreign Agents.

   The LifeTime of such a registration is chosen by the Mobile Node.  By
   default, the Router Advertisement LifeTime (1800 seconds) is used.

   The LifeTime MAY be modified by the Home Agent in its reply.

   However, on those links where the Mobile Node detects an Agent
   Advertisement that has the "F" bit set in the Mobility Extension, the
   Mobile Node SHOULD register through an appropriate Foreign Agent,
   even when it could otherwise register directly with a Home Agent.

   It is assumed that such a Mobile Node has mechanisms to detect
   changes in its link-layer connectivity, and to initiate acquisition
   of a new transient address each time such a change occurs.  The
   mechanisms will be specific to the particular link-layer technology,
   and are outside the scope of this document.



6.4.  De-registration When At Home

   At times, a Mobile Node might attach itself to its home link.  Since
   a Mobile Node that is at home needs no forwarding, a de-registration



Simpson                  expires in six months                 [Page 26]
DRAFT                         IP Mobility                      July 1994


   procedure MUST be used between the Mobile Node and its Home Agent.

   The de-registration process involves the exchange of only two
   messages:

   a)    The Mobile Node sends a Registration Request directly to its
         Home Agent, with the LifeTime set to zero, and the Code field
         set to 0, to indicate that the Home Agent remove all related
         entries.

   b)    The Home Agent sends a Registration Reply to the Mobile Node to
         grant or deny service.

   In this special case, the Care-Of-Address is set to the Home-Address.

   This procedure is specified for the sake of convenience.  The Mobile
   Node is not required to register with its Home Agent.  It MAY de-
   register each Foreign Agent, or it MAY allow its Mobility Bindings to
   simply expire.

   It is not necessary to re-register with a Home Agent when a change of
   Sequence Number occurs, or the Advertisement LifeTime expires, since
   the Mobile Node is not seeking encapsulating service.



6.5.  Registration Replies

   When a Mobile Node receives a Registration Reply which has a
   TimeStamp which is not the same as the TimeStamp of its most recent
   Registration Request to the putative sender, the message is silently
   discarded.

   When a Reply is received which has a Code indicating information from
   the Foreign Agent, the Mobile-Home Authenticator will be missing or
   invalid.  However, if no other reply has as yet been received, the
   reason for denial SHOULD be accepted, and result in an appropriate
   action.  If a later authenticated reply is received, that reply
   supercedes the unauthenticated reply.

   When a Reply is received which has a Code indicating that
   authentication failed with the Home Agent, the reason for denial
   SHOULD result in an appropriate action.

   Otherwise, when a Reply is received with an invalid Authenticator,
   the message is silently discarded.

   When the LifeTime of the reply is greater than the original request,



Simpson                  expires in six months                 [Page 27]
DRAFT                         IP Mobility                      July 1994


   the excess time SHOULD be ignored.  When the LifeTime of the reply is
   smaller than the original request, re-registration SHOULD occur
   before the LifeTime expires.

   The Mobile Node is not required to issue any message in reply to a
   Registration Reply.



6.6.  Registration Retransmission

   When no Reply has been received within a reasonable time, the
   Registration Request is re-transmitted.  A new TimeStamp is chosen
   for each retransmission.

   The minimum retransmission time SHOULD be related to the speed of the
   link.  The minimum value SHOULD be large enough to account for the
   size of the packets, twice the round trip time for transmission at
   the link speed, and at least an additional 100 milliseconds to allow
   for processing the packets before responding.  Some circuits add
   another 200 milliseconds of satellite delay.

   The initial time MUST NOT be less than 1 second.  At 9,600 bps or
   less, the recommended initial time is 3 seconds.  At 1,200 bps or
   less, the recommended initial time is 5 seconds.

   Each successive value less than the maximum value SHOULD be at least
   twice the previous value.

   The maximum retransmission time SHOULD be no greater than the
   LifeTime of the Registration Request.



6.7.  Simultaneous Registrations

   Under normal circumstances, sending a new Registration Request
   removes other unexpired registrations for a Mobile Node from the Home
   Agent.

   An optional capability is to allow multiple simultaneous
   registrations.  For example, this is particularly useful when a
   Mobile Node is on a border between multiple cellular systems.

   In order to request simultaneous registrations, the Mobile Node sends
   the Registration Request with the Code set to 1.

   The return Code in the Registration Reply is the same.  No error



Simpson                  expires in six months                 [Page 28]
DRAFT                         IP Mobility                      July 1994


   occurs if the Home Agent is unable to fulfill the request.

   IP explicitly allows duplication of datagrams.  When the Home Agent
   is able to fulfill the request, the Home Agent will encapsulate a
   separate copy of each arriving datagram to each Care-Of-Address, and
   the Mobile Node will receive multiple copies of its datagrams.

   When the need for multiple registrations has passed, the Mobile Node
   SHOULD re-register with the Code set to 0, to remove the other
   registrations.



6.8.  Mobile Routers

   A Mobile Node can be a router, which is responsible for the mobility
   of an entire network moving together, such as on an airplane, a ship,
   a train, an automobile, a bicycle, or a kayak.

   Provision for a Routing-Prefix in registration messages is needed
   when a Mobile Node registers through a Foreign Agent.  This allows a
   Foreign Agent to recognize all addresses attached to the Mobile Node
   when they are decapsulated at the Care-Of-Address.

   When a transient IP address has been assigned, the Mobile Node can
   register directly with the Home Agent, as described previously.  Such
   a Mobile Node MAY advertise to other routers in the foreign routing
   domain.

   The Mobile Node MAY register multiple times with different Home-
   Addresses and Routing-Prefixes.  This permits multiple prefixes to be
   routed through the Mobile Node.

   When the Mobile Node returns home, and de-registers with the Home
   Agent, it participates directly in routing with other routers in its
   home routing domain.



7.  Foreign Agent Considerations

   It is the intent that Foreign Agent involvement be as minimal as
   possible.  The role of the Foreign Agent is passive, passing
   registration requests to the Home Agent, and decapsulating datagrams
   to pass to the Mobile Node.

   When no Mobility Security Association exists, this also reduces the
   risks resulting from absence of authentication from Foreign Agent



Simpson                  expires in six months                 [Page 29]
DRAFT                         IP Mobility                      July 1994


   messages.

   The Foreign Agent MUST NOT originate a Request or Reply that has not
   been prompted by the Mobile Node.  No Request or Reply is generated
   to indicate that the service LifeTime has expired.

   A Foreign Agent MUST NOT originate a message which revokes the
   registration of a different Foreign Agent.  A Foreign Agent SHOULD
   forward such revocations without modification when such revocation
   messages originated from an appropriate Mobile Node or Home Agent.

   The Foreign Agent SHOULD NOT advertise the presence of the Mobile
   Node which is a router to other routers in its routing domain.



7.1.  Configuration and Registration Tables

   Each Foreign Agent will need:

    - Care-Of-Address

   For each pending or current registration, the Foreign Agent will need
   a Visitor List entry:

    - Media Address of Mobile
    - Home-Address
    - Prefix-Size
    - Home Agent
    - TimeStamp used
    - LifeTime

   A Foreign Agent that has implemented and is using authentication will
   also need to have the Mobility Security Association information for
   each pending or current authenticated registration.  Even if a
   Foreign Agent implements authentication, it might not use
   authentication with each registration, because of the key management
   difficulties.



7.2.  Receiving Registration Requests

   Upon receipt of a Registration Request, if the Foreign Agent is
   unable to satisfy the request for some reason, then the Foreign Agent
   sends a Registration Reply to the Mobile Node with an appropriate
   Code, and does not forward the request to the Home Agent.




Simpson                  expires in six months                 [Page 30]
DRAFT                         IP Mobility                      July 1994


   Otherwise, the Foreign Agent will forward the Request to the Home
   Agent, modifying the Type, substituting the Foreign-Home
   Authenticator for the Mobile-Foreign Authenticator as necessary, and
   leaving the remaining fields unchanged.

   The Foreign Agent must maintain a list of pending Requests, which
   includes the IP Source Address and UDP Source Port, in order that a
   correctly addressed Reply can be returned to the Mobile Node.



7.3.  Receiving Registration Replies

   The fields of the Registration Reply MUST be examined for validity.
   A Registration Reply which does not relate to a pending Registration
   Request, or to a currently registered Mobile Node, is silently
   discarded.

   If the Registration Reply granted permission to provide service to
   the Mobile Node, then the Foreign Agent updates its Visitor List
   accordingly.



7.4.  Decapsulation

   Every Foreign Agent MUST examine all arriving encapsulated traffic
   for both the Home-Address and Routing-Prefix in order to forward to
   the correct Mobile Node.                                               |

   When the Destination does not match any node currently in the Visitor  |
   List, the datagram MUST be silently discarded (rather than being       |
   further forwarded).  ICMP Destination Unreachable MUST NOT be sent     |
   when a Foreign Agent is unable to forward a datagram.



7.5.  Mobility

   The Foreign Agent can be mobile, if the link identified by the Care-
   Of-Address is mobile.  The Foreign Agent could be either a node on a
   mobile network, or another Mobile Node itself.



8.  Home Agent Considerations

   It is the intent that the Home Agent have primary responsibility for



Simpson                  expires in six months                 [Page 31]
DRAFT                         IP Mobility                      July 1994


   processing and coordinating mobility services.

   The Home Agent for a given Mobile Node SHOULD be located on the link
   identified by the Home-Address.  This link MAY be virtual.

   The Home Agent SHOULD advertise the presence of the Mobile Node which
   is a router to other routers in its routing domain.



8.1.  Configuration and Registration Tables

   Each Home Agent will need:

    - an IP Address
    - Prefix-Size for the Home Network, if any

   For each authorized Mobile Node, the Home Agent will need:

    - Home-Address
    - Prefix-Size for the Mobile Network, if any

   For each registered Mobile Node, the Home Agent will need a
   Forwarding List entry:

    - Care-Of-Address
    - TimeStamp used
    - LifeTime

   For each Mobility Security Association:

    - Authentication Type
    - Authentication Key



8.2.  Receiving Registration Requests

   Upon receipt of a Registration Request, the Home Agent grants or
   denies the service requested by sending a Registration Reply to the
   sender of the request, with the appropriate Code set.

   The Request is validated by checking that the TimeStamp is not the
   same as a preceeding Request, and the Mobile-Home Authentation
   Extension is correct.  Other Authentication Extensions are also
   validated when present.

   The Home Agent MAY shorten the LifeTime of the request.



Simpson                  expires in six months                 [Page 32]
DRAFT                         IP Mobility                      July 1994


   If service permission is granted, the Home Agent will update its
   Forwarding List with the Care-Of-Address of the tunnel.

   If the Request asks for termination of service by indicating a
   LifeTime of zero, and the Code field set to 1, the Home Agent removes
   the Mobility Binding for that Care-Of-Address from its Forwarding
   List.

   If the Request asks for termination of service by indicating a
   LifeTime of zero, and the Code field set to 0, the Home Agent removes
   the Mobility Bindings for all Foreign Agents associated with that
   Mobile Node from its Forwarding List.

   On termination, no special Reply is sent to additional associated
   Foreign Agents.  The entries in their Visiting Lists are allowed to
   expire naturally.


8.3.  Receiving Requests through a Foreign Agent

   When a Registration Request is invalid, a Reply is sent to the
   Foreign Agent, in order that the Foreign Agent can clear its pending
   request list.



8.4.  Simultaneous Registrations

   When a Home Agent supports the optional capability of multiple
   simultaneous registrations, any datagrams forwarded are simply
   duplicated, and a copy is sent to each Care-Of-Address.

   The return Code in the Registration Reply is the same.  No error
   occurs if the Home Agent is unable to fulfill the request, and
   earlier entries in the Forwarding List are removed.



8.5.  Registration Expiration

   If the LifeTime for a given Mobile Node expires before the Home Agent
   has received a re-registration request, then the associated Mobility
   Binding is erased from the Forwarding List.

   No special Registration Reply is sent to the Foreign Agents.  The
   entries in the Visiting Lists will expire naturally, and probably at
   the same time.




Simpson                  expires in six months                 [Page 33]
DRAFT                         IP Mobility                      July 1994


8.6.  Encapsulation

   Every Home Agent MUST examine all arriving traffic for both the
   Home-Address and Routing-Prefix in order to forward to the correct
   Mobile Node.

   When previously encapsulated datagrams arrive which are associated
   with the Routing-Prefix of the Mobile Node, the Home Agent simply
   alters the Destination to the Care-Of-Address.  This avoids recursive
   encapsulation.

   Previously encapsulated datagrams which are not associated with the
   Routing-Prefix are recursively encapsulated.



8.7.  Mobility

   The Home Agent can be mobile, if the link identified by the Home-
   Address it serves is mobile.  The Home Agent could be either a node
   on a mobile network, or another Mobile Node itself.

   A datagram would be encapsulated on its way to the mobile network,
   decapsulated for delivery to the Mobile Node, intercepted by the Home
   Agent, and re-encapsulated to the Mobile Node.


























Simpson                  expires in six months                 [Page 34]
DRAFT                         IP Mobility                      July 1994


A.  Gratuitous and Proxy ARP                                              |

   Many people will use their computers for extended periods of time on   |
   a single link, whether or not it is at their Home Network.  When       |
   doing so, they will expect the same level of service from their        |
   infrastructure as they receive today on the Home Network.              |

   A separate "virtual" IP address block is not required for Mobile       |
   Hosts.  This would require a small network to have an extra router     |
   between the mobile and non-mobile nodes, which is an unacceptable      |
   expense.                                                               |

   This section details the special care to be taken when using ARP       |
   [RFC-826] with nodes on the same link as a Mobile Node.                |

   A problem can arise if a Mobile Node which has previously answered an  |
   ARP Request moves away from the link, leaving behind a stale entry in  |
   another node's ARP cache.  For example, if a router which forwards     |
   datagrams into the Home Network has a stale ARP cache entry for the    |
   Mobile Node, any datagrams arriving through that router for the        |
   Mobile Node will be lost.  Thus, it is important that ARP caches of    |
   nodes populating the link be updated as soon as possible.              |

   A gratuitous ARP is an ARP Reply that is broadcast to all nodes on a   |
   link, which is not in response to any ARP Request.  When an ARP Reply  |
   is broadcast, all hosts are required to update their local ARP         |
   caches, whether or not the ARP Reply was in response to an ARP         |
   Request they had issued.                                               |

   Therefore, a gratuitous proxy ARP is issued by the Home Agent on       |
   behalf of a Mobile Node whenever the Home Agent receives a valid       |
   registration.  The gratuitous proxy ARP will indicate that all         |
   remaining nodes should associate the Home-Address of the Mobile Node   |
   with the link-layer address of the Home Agent which is now serving     |
   the Mobile Node.                                                       |

   For this purpose, the source IP address would be the Home-Address,     |
   the source link-layer address would be for the interface used, the     |
   target IP address would be the all-systems multicast address, and the  |
   target link-layer address would be the general broadcast.              |

   Another proxy ARP will be sent in response to further Mobile Node      |
   registration requests, or Correspondent ARP Requests.                  |

   While the Mobile Node is away from its Home Network, the Home Agent    |
   performs proxy ARP Replies for the Mobile Node.                        |

   When a Mobile Node returns to its Home Network, it SHOULD issue a      |



Simpson                  expires in six months                 [Page 35]
DRAFT                         IP Mobility                      July 1994


   gratuitous ARP on its own behalf, immediately before sending the de-   |
   registration request to the Home Agent.                                |

   Although the gratuitous ARP can be lost, this is not different from    |
   the usual ARP Reply problems, which are outside the scope of this      |
   document.  An implementation MUST NOT repeat the gratuitous ARP        |
   without a specific stimuli of the registration or de-registration      |
   request.                                                               |



B.  TCP Timers                                                            *

   Most hosts and routers which implement TCP/IP do not permit easy
   configuration of the TCP Timer values.  When high-delay (e.g. SATCOM)
   or low-bandwidth (e.g. High-Frequency Radio) links are in use, the
   default TCP Timer values in many systems will cause retransmissions
   or timeouts when the link and network is actually operating properly,
   though with greater than usual delays because of the media in use.
   This can cause an inability to create or maintain connections over
   such links, and can also cause unneeded retransmissions which consume
   already scarce bandwidth.  Vendors are encouraged to make TCP Timers
   more configurable.  Vendors of systems designed for the mobile
   computing markets should pick default timer values more suited to
   low-bandwidth, high-delay links.  Users of Mobile Nodes should be
   sensitive to the possibility of timer-related difficulties.

























Simpson                  expires in six months                 [Page 36]
DRAFT                         IP Mobility                      July 1994


Security Considerations

   The mobile computing environment is potentially very different from
   the ordinary computing environment.  In many cases, mobile computers
   will be connected to the network via wireless links.  Such links are
   particularly vulnerable to passive eavesdropping, active replay
   attacks, and other active attacks.

   The registration protocol described here will result in a host's
   traffic being source routed to its mobile location.  Such traffic
   redirection could be a significant vulnerability when the
   registration were not authentic.  Also, source routing is widely
   understood to be a security problem in the current Internet.
   [Bellovin89] The Address Resolution Protocol (ARP) is not
   authenticated, and can potentially be used to steal another host's
   traffic.  The use of "Gratuitous ARP" as described in this
   specification increases the risks of ARP because ARP is not
   authenticatable.

   This specification includes a strong authentication mechanism (keyed
   MD5) which precludes many potential attacks based on the Mobile IP
   registration protocol.  However, because key distribution is
   difficult in the absence of a network key management protocol, not
   all messages with the Foreign Agent are authenticated.
   Vulnerabilities remain in the registration protocol whenever a
   registration message is not authenticated.  For example, in a
   commercial environment it might be important to authenticate all
   messages between the Foreign Agent and the Home Agent, so that
   billing is possible, and service providers don't provide service to
   users that are not legitimate customers of that service provider.

   The strength of any authentication mechanism is dependent on several
   factors, including the innate strength of the authentication
   algorithm, the secrecy of the key used, the strength of the key used,
   and the quality of the particular implementation.  This specification
   requires implementation of keyed MD5 for authentication, but does not
   preclude the use of other authentication algorithms and modes.  For
   keyed MD5 authentication to be useful, the 128-bit key must be both
   secret (that is, known only to authorised parties) and pseudo-random.
   RFC-XXXX provides more information on generating pseudo-random
   numbers.

   Users who have sensitive data that they do not wish others to see      |
   should use mechanisms outside the scope of this document (such as
   encryption) to provide appropriate protection.  Users concerned about
   traffic analysis should consider appropriate use of link encryption.





Simpson                  expires in six months                 [Page 37]
DRAFT                         IP Mobility                      July 1994


References

   [Voydock83]                                                            |
         Voydock, V.L., S.T. Kent, "Security Mechanisms in High-level     |
         Networks", ACM Computing Surveys, Vol. 15, No. 2, June 1983.     |

   [Bellovin89]                                                           |
         Bellovin, S.M., "Security Problems in the TCP/IP Protocol        |
         Suite", ACM Computer Communications Review, Vol. 19, No. 2,      |
         March 1989.                                                      |

   [RFC-768]                                                              |

   [RFC-791]                                                              |

   [RFC-826]                                                              |

   [RFC-1122]                                                             |

   [RFC-1256]                                                             |

   [RFC-1310]                                                             |

   [RFC-1305]                                                             |

   [RFC-1321]                                                             |

   [RFC-1332]                                                             |

   [RFC-1548]                                                             |

   [RFC-XXXX]                                                             |
         Eastlake, D.E.3, S.D. Crocker, J.I. Schiller, "Randomness        |
         Requirements for Security", work in progress.



Acknowledgements                                                          |

   Special thanks to John Ioannidis (Columbia), for his inspiration and
   experimentation which began this most recent round of IP mobility
   development.

   Special thanks also to Steve Deering (Xerox PARC), for his early
   support as Chair of the Working Group.

   Many thanks to Charlie Perkins (IBM), who tirelessly proposed common
   definitions and summaries, without which we may still have



Simpson                  expires in six months                 [Page 38]
DRAFT                         IP Mobility                      July 1994


   uncomparable proposals with different terminologies.  Charlie also
   coalesed the Home and Foreign Agent objects.

   Security details are primarily the work of Randall Atkinson (NRL).

   Tunnel soft state was originally developed for the "IP Address
   Encapsulation (IPAE)" specification, by Robert E. Gilligan, Erik
   Nordmark, and Bob Hinden (all of Sun Microsystems).

   Much of the text of this specification is derived from earlier drafts
   by Charlie Kunzinger (IBM), the former Working Group Editor, who
   never put his name on the document.

   Thanks to the verbose members of the Working Group, particularly
   those who contributed text, including Dave Johnson (Carnegie Mellon
   University), Tony Li (Cisco Systems), Andrew Myles (Macquarie
   University), John Penners (US West), Fumio Taraoka (Sony), and John
   Zao (Harvard).

   Finally, the Editor wishes to thank Phil Karn (Qualcomm), whose
   decade of IP mobility experimentation in the amateur radio community,
   and widespread freeware dissemination of his KA9Q software, provided
   the impetus and availability for many thousands throughout the world
   to join the Internet community.



























Simpson                  expires in six months                 [Page 39]
DRAFT                         IP Mobility                      July 1994


Chair's Address

   The working group can be contacted via the current chairs:

      Greg Minshall                           Kannan                      |



      617-873-4153                                                        |

      minshall@wc.novell.com                                              |



Editor's Address

   Questions about this memo can also be directed to:

      William Allen Simpson
      Daydreamer
      Computer Systems Consulting Services
      1384 Fontaine
      Madison Heights, Michigan  48071

      Bill.Simpson@um.cc.umich.edu
          bsimpson@MorningStar.com

























Simpson                  expires in six months                 [Page 40]
DRAFT                         IP Mobility                      July 1994


                           Table of Contents


     1.     Introduction ..........................................    1
        1.1       Requirements ....................................    2
        1.2       Goals ...........................................    3
        1.3       Assumptions .....................................    3
        1.4       Specification Language ..........................    3
        1.5       Terminology .....................................    4

     2.     Agent Discovery .......................................    6
        2.1       Authentication ..................................    7
        2.2       Agent Solicitation ..............................    7
        2.3       Agent Advertisement .............................    7

     3.     Registration ..........................................    9
        3.1       Authentication ..................................    9
        3.2       UDP .............................................   10
        3.3       Registration Request ............................   11
        3.4       Registration Reply ..............................   14

     4.     Mobility Message Extensions ...........................   16
        4.1       Mobility Extension ..............................   17
        4.2       Mobile-Home Authentication Extension ............   17
        4.3       Mobile-Foreign Authentication Extension .........   18
        4.4       Foreign-Home Authentication Extension ...........   19
        4.5       Minimal Encapsulation Extension .................   20

     5.     Forwarding Datagrams to the Mobile Node ...............   21
        5.1       IP in IP Encapsulation ..........................   21
        5.2       Minimal Encapsulation ...........................   22
        5.3       Tunnel Management ...............................   23

     6.     Mobile Node Considerations ............................   25
        6.1       Configuration and Registration Tables ...........   25
        6.2       Registration When Away From Home ................   25
        6.3       Registration without a Foreign Agent ............   26
        6.4       De-registration When At Home ....................   26
        6.5       Registration Replies ............................   27
        6.6       Registration Retransmission .....................   28
        6.7       Simultaneous Registrations ......................   28
        6.8       Mobile Routers ..................................   29

     7.     Foreign Agent Considerations ..........................   29
        7.1       Configuration and Registration Tables ...........   30
        7.2       Receiving Registration Requests .................   30
        7.3       Receiving Registration Replies ..................   31
        7.4       Decapsulation ...................................   31



Simpson                  expires in six months                 [Page ii]
DRAFT                         IP Mobility                      July 1994


        7.5       Mobility ........................................   31

     8.     Home Agent Considerations .............................   31
        8.1       Configuration and Registration Tables ...........   32
        8.2       Receiving Registration Requests .................   32
        8.3       Receiving Requests through a Foreign Agent ......   33
        8.4       Simultaneous Registrations ......................   33
        8.5       Registration Expiration .........................   33
        8.6       Encapsulation ...................................   34
        8.7       Mobility ........................................   34

     APPENDICES ...................................................   35

     A.     Gratuitous and Proxy ARP ..............................35   |

     B.     TCP Timers ............................................   36

     SECURITY CONSIDERATIONS ......................................   37

     REFERENCES ...................................................   38

     ACKNOWLEDGEMENTS .............................................   38

     CHAIR'S ADDRESS ..............................................   40

     EDITOR'S ADDRESS .............................................   40

























